app/controllers/admin/customizes_controller.rb

INSERT INTO `customizes` (`file`, `installed`, `created_at`, `updated_at`) VALUES ('Web_MaruLeon.zip', 0, '2017-07-10 14:41:15.388410', '2017-07-10 14:41:15.388410')
---
    def create
      @customize = Customize.new(customize_params)
      @customize.installed = false

      if @customize.save

SELECT `customizes`.* FROM `customizes`
UPDATE `customizes` SET `installed` = 0, `updated_at` = '2017-07-10 14:41:30.985284' WHERE `customizes`.`id` = 1
---
    def update
      @customizes = Customize.all
      @customizes.each { |customize| customize.update(installed: false) }

SELECT  `customizes`.* FROM `customizes` WHERE `customizes`.`id` = 1 LIMIT 1
SELECT `customizes`.* FROM `customizes`
UPDATE `customizes` SET `installed` = 1, `updated_at` = '2017-07-10 16:31:58.356578' WHERE `customizes`.`id` = 1
---
    def install_default
      @customize = Customize.find(params[:customize_id])
      if !@customize.installed?
        @customizes = Customize.all
        @customizes.each { |customize| customize.update(installed: false) }

DELETE FROM `customizes` WHERE `customizes`.`id` = 2
---
    def destroy_multiple
      Customize.destroy redefine_ids(params[:multiple_ids])

SELECT  `customizes`.* FROM `customizes` WHERE `customizes`.`id` = 4 LIMIT 1
---
    def set_customize
      @customize = Customize.find(params[:id])